app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `name`, `updated_at`) VALUES ('2012-08-28 00:49:48', 'Masiha', '2012-08-28 00:49:48')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save